OpenEPaperLink/OpenEPaperLink/ARM_Tag_FW/cc2531_OEPL/contiki/sdcc/non-free/include/pic16/pic18f4455.h
#define _FOSC_XT_XT_1H          0xF0    // XT oscillator (XT).
#define _FOSC_XTPLL_XT_1H       0xF2    // XT oscillator, PLL enabled (XTPLL).
#define _FOSC_ECIO_EC_1H        0xF4    // EC oscillator, port function on RA6 (ECIO).
#define _FOSC_EC_EC_1H          0xF5    // EC oscillator, CLKO function on RA6 (EC).
#define _FOSC_ECPLLIO_EC_1H     0xF6    // EC oscillator, PLL enabled, port function on RA6 (ECPIO).
#define _FOSC_ECPLL_EC_1H       0xF7    // EC oscillator, PLL enabled, CLKO function on RA6 (ECPLL).
#define _FOSC_INTOSCIO_EC_1H    0xF8    // Internal oscillator, port function on RA6, EC used by USB (INTIO).
#define _FOSC_INTOSC_EC_1H      0xF9    // Internal oscillator, CLKO function on RA6, EC used by USB (INTCKO).
#define _FOSC_INTOSC_XT_1H      0xFA    // Internal oscillator, XT used by USB (INTXT).
#define _FOSC_INTOSC_HS_1H      0xFB    // Internal oscillator, HS oscillator used by USB (INTHS).
#define _FOSC_HS_1H             0xFC    // HS oscillator (HS).
#define _FOSC_HSPLL_HS_1H       0xFE    // HS oscillator, PLL enabled (HSPLL).
#define _FCMEN_OFF_1H           0xBF    // Fail-Safe Clock Monitor disabled.
#define _FCMEN_ON_1H            0xFF    // Fail-Safe Clock Monitor enabled.
#define _IESO_OFF_1H            0x7F    // Oscillator Switchover mode disabled.
#define _IESO_ON_1H             0xFF    // Oscillator Switchover mode enabled.

//----------------------------- CONFIG2L Options -------------------------------

#define _PWRT_ON_2L             0xFE    // PWRT enabled.
#define _PWRT_OFF_2L            0xFF    // PWRT disabled.
#define _BOR_OFF_2L             0xF9    // Brown-out Reset disabled in hardware and software.
#define _BOR_SOFT_2L            0xFB    // Brown-out Reset enabled and controlled by software (SBOREN is enabled).
#define _BOR_ON_ACTIVE_2L       0xFD    // Brown-out Reset enabled in hardware only and disabled in Sleep mode (SBOREN is disabled).
#define _BOR_ON_2L              0xFF    // Brown-out Reset enabled in hardware only (SBOREN is disabled).
#define _BORV_0_2L              0xE7    // Maximum setting 4.59V.
#define _BORV_1_2L              0xEF    // Setting 2 4.33V.
#define _BORV_2_2L              0xF7    // Setting 1 2.79V.
#define _BORV_3_2L              0xFF    // Minimum setting 2.05V.
#define _VREGEN_OFF_2L          0xDF    // USB voltage regulator disabled.
#define _VREGEN_ON_2L           0xFF    // USB voltage regulator enabled.

//----------------------------- CONFIG2H Options -------------------------------

#define _WDT_OFF_2H             0xFE    // WDT disabled (control is placed on the SWDTEN bit).
#define _WDT_ON_2H              0xFF    // WDT enabled.
#define _WDTPS_1_2H             0xE1    // 1:1.
#define _WDTPS_2_2H             0xE3    // 1:2.
#define _WDTPS_4_2H             0xE5    // 1:4.
#define _WDTPS_8_2H             0xE7    // 1:8.
#define _WDTPS_16_2H            0xE9    // 1:16.
#define _WDTPS_32_2H            0xEB    // 1:32.
#define _WDTPS_64_2H            0xED    // 1:64.
#define _WDTPS_128_2H           0xEF    // 1:128.
#define _WDTPS_256_2H           0xF1    // 1:256.
#define _WDTPS_512_2H           0xF3    // 1:512.
#define _WDTPS_1024_2H          0xF5    // 1:1024.
#define _WDTPS_2048_2H          0xF7    // 1:2048.
#define _WDTPS_4096_2H          0xF9    // 1:4096.
#define _WDTPS_8192_2H          0xFB    // 1:8192.
#define _WDTPS_16384_2H         0xFD    // 1:16384.
#define _WDTPS_32768_2H         0xFF    // 1:32768.

//----------------------------- CONFIG3H Options -------------------------------

#define _CCP2MX_OFF_3H          0xFE    // CCP2 input/output is multiplexed with RB3.
#define _CCP2MX_ON_3H           0xFF    // CCP2 input/output is multiplexed with RC1.
#define _PBADEN_OFF_3H          0xFD    // PORTB<4:0> pins are configured as digital I/O on Reset.
#define _PBADEN_ON_3H           0xFF    // PORTB<4:0> pins are configured as analog input channels on Reset.
#define _LPT1OSC_OFF_3H         0xFB    // Timer1 configured for higher power operation.
#define _LPT1OSC_ON_3H          0xFF    // Timer1 configured for low-power operation.
#define _MCLRE_OFF_3H           0x7F    // RE3 input pin enabled; MCLR pin disabled.
#define _MCLRE_ON_3H            0xFF    // MCLR pin enabled; RE3 input pin disabled.

//----------------------------- CONFIG4L Options -------------------------------

#define _STVREN_OFF_4L          0xFE    // Stack full/underflow will not cause Reset.
#define _STVREN_ON_4L           0xFF    // Stack full/underflow will cause Reset.
#define _LVP_OFF_4L             0xFB    // Single-Supply ICSP disabled.
#define _LVP_ON_4L              0xFF    // Single-Supply ICSP enabled.
#define _ICPRT_OFF_4L           0xDF    // ICPORT disabled.
#define _ICPRT_ON_4L            0xFF    // ICPORT enabled.
#define _XINST_OFF_4L           0xBF    // Instruction set extension and Indexed Addressing mode disabled (Legacy mode).
#define _XINST_ON_4L            0xFF    // Instruction set extension and Indexed Addressing mode enabled.
#define _DEBUG_ON_4L            0x7F    // Background debugger enabled, RB6 and RB7 are dedicated to In-Circuit Debug.
#define _DEBUG_OFF_4L           0xFF    // Background debugger disabled, RB6 and RB7 configured as general purpose I/O pins.

//----------------------------- CONFIG5L Options -------------------------------

#define _CP0_ON_5L              0xFE    // Block 0 (000800-001FFFh) is code-protected.
#define _CP0_OFF_5L             0xFF    // Block 0 (000800-001FFFh) is not code-protected.
#define _CP1_ON_5L              0xFD    // Block 1 (002000-003FFFh) is code-protected.
#define _CP1_OFF_5L             0xFF    // Block 1 (002000-003FFFh) is not code-protected.
#define _CP2_ON_5L              0xFB    // Block 2 (004000-005FFFh) is code-protected.
#define _CP2_OFF_5L             0xFF    // Block 2 (004000-005FFFh) is not code-protected.

//----------------------------- CONFIG5H Options -------------------------------

#define _CPB_ON_5H              0xBF    // Boot block (000000-0007FFh) is code-protected.
#define _CPB_OFF_5H             0xFF    // Boot block (000000-0007FFh) is not code-protected.
#define _CPD_ON_5H              0x7F    // Data EEPROM is code-protected.
#define _CPD_OFF_5H             0xFF    // Data EEPROM is not code-protected.

//----------------------------- CONFIG6L Options -------------------------------

#define _WRT0_ON_6L             0xFE    // Block 0 (000800-001FFFh) is write-protected.
#define _WRT0_OFF_6L            0xFF    // Block 0 (000800-001FFFh) is not write-protected.
#define _WRT1_ON_6L             0xFD    // Block 1 (002000-003FFFh) is write-protected.
#define _WRT1_OFF_6L            0xFF    // Block 1 (002000-003FFFh) is not write-protected.
#define _WRT2_ON_6L             0xFB    // Block 2 (004000-005FFFh) is write-protected.
#define _WRT2_OFF_6L            0xFF    // Block 2 (004000-005FFFh) is not write-protected.

//----------------------------- CONFIG6H Options -------------------------------

